Revit 2024 API
AnalysisResultSchema.GetUnitsName Method
 returns units name by index
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public string GetUnitsName(
	int index
)
Visual Basic
Public Function GetUnitsName ( _
	index As Integer _
) As String
Visual C++
public:
String^ GetUnitsName(
	int index
)
Parameters
index
Type: System.Int32
 index of unit in the list
See Also
AnalysisResultSchema Class
Autodesk.Revit.DB.Analysis Namespace